---
kind: property
id: P:Autodesk.Revit.DB.FamilySizeTableErrorInfo.FamilySizeTableErrorType
source: html/de437714-1bef-c121-9558-15c6cc07e946.htm
---
# Autodesk.Revit.DB.FamilySizeTableErrorInfo.FamilySizeTableErrorType Property

The error type.

## Syntax (C#)
```csharp
public FamilySizeTableErrorType FamilySizeTableErrorType { get; }
```